_sdaiCreateRepository(Sdai_instS*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*)
\details
Creates a new repository with a specified name within the current SDAI session.
\param session [in] An SDAI session instance.
\param name [in] A string that contains the new repository name.
\returns A pointer to the created repository if it was successfully created; otherwise, the function returns the NULL pointer.